In [22]:
import pandas as pd
data=pd.DataFrame({'Brand':['Maruti','Hundai','Tata','Maruti','Renault','Maruti',],'Year':[2001,2002,2005,2006,2009,20016],'kms Driven':[50000,30000,20000,40000,60000,3000],'City':['Gujrat','Delhi','Mumbai','Chennai','Ghaziabad','Delhi'],'Mileage':[28,27,25,26,28,29]})
display(data)

     Brand   Year  kms Driven       City  Mileage
0   Maruti   2001       50000     Gujrat       28
1   Hundai   2002       30000      Delhi       27
2     Tata   2005       20000     Mumbai       25
3   Maruti   2006       40000    Chennai       26
4  Renault   2009       60000  Ghaziabad       28
5   Maruti  20016        3000      Delhi       29

In [24]:
display(data.loc[(data.Brand=='Maruti')&(data.Mileage>25)])

    Brand   Year  kms Driven     City  Mileage
0  Maruti   2001       50000   Gujrat       28
3  Maruti   2006       40000  Chennai       26
5  Maruti  20016        3000    Delhi       29

In [26]:
#Tata to maruti
display(data.loc[2:5])

     Brand   Year  kms Driven       City  Mileage
2     Tata   2005       20000     Mumbai       25
3   Maruti   2006       40000    Chennai       26
4  Renault   2009       60000  Ghaziabad       28
5   Maruti  20016        3000      Delhi       29

In [28]:
display(data.loc[2:5,['Brand','Mileage']])

     Brand  Mileage
2     Tata       25
3   Maruti       26
4  Renault       28
5   Maruti       29

In [50]:
import pandas as pd
data=pd.DataFrame({'Brand':['Maruti','Hundai','Tata','Maruti','Renault','Maruti',],'Year':[2001,2002,2005,2006,2009,20016],'kms Driven':[50000,30000,20000,40000,60000,3000],'City':['Gujrat','Delhi','Mumbai','Chennai','Ghaziabad','Delhi'],'Mileage':[28,27,25,26,28,29]})
display(data)
data.loc[(data.Year<2015),['Mileage']]=2
display(data)

     Brand   Year  kms Driven       City  Mileage
0   Maruti   2001       50000     Gujrat       28
1   Hundai   2002       30000      Delhi       27
2     Tata   2005       20000     Mumbai       25
3   Maruti   2006       40000    Chennai       26
4  Renault   2009       60000  Ghaziabad       28
5   Maruti  20016        3000      Delhi       29

     Brand   Year  kms Driven       City  Mileage
0   Maruti   2001       50000     Gujrat        2
1   Hundai   2002       30000      Delhi        2
2     Tata   2005       20000     Mumbai        2
3   Maruti   2006       40000    Chennai        2
4  Renault   2009       60000  Ghaziabad        2
5   Maruti  20016        3000      Delhi       29

In [54]:
import pandas as pd
data=pd.DataFrame({'Brand':['Maruti','Hundai','Tata','Maruti','Renault','Maruti',],'Year':[2001,2002,2005,2006,2009,20016],'kms Driven':[50000,30000,20000,40000,60000,3000],'City':['Gujrat','Delhi','Mumbai','Chennai','Ghaziabad','Delhi'],'Mileage':[28,27,25,26,28,29]})
display(data)
display(data.iloc[[0,2,4]])

     Brand   Year  kms Driven       City  Mileage
0   Maruti   2001       50000     Gujrat       28
1   Hundai   2002       30000      Delhi       27
2     Tata   2005       20000     Mumbai       25
3   Maruti   2006       40000    Chennai       26
4  Renault   2009       60000  Ghaziabad       28
5   Maruti  20016        3000      Delhi       29

     Brand  Year  kms Driven       City  Mileage
0   Maruti  2001       50000     Gujrat       28
2     Tata  2005       20000     Mumbai       25
4  Renault  2009       60000  Ghaziabad       28

In [44]:
display(data.iloc[[0,2,4,5]])

     Brand   Year  kms Driven       City  Mileage
0   Maruti   2001       50000     Gujrat       28
2     Tata   2005       20000     Mumbai       25
4  Renault   2009       60000  Ghaziabad       28
5   Maruti  20016        3000      Delhi       29

data.loc[(data.Year<2015),['Mileage']]=2
display(data)

In [2]:
import pandas as pd
data={
    'Name':['Alice','Bob','Charlie','David'],
    'Age':[25,30,35,40],
    'Salary':[50000,60000,70000,80000]
}
df=pd.DataFrame(data,index=['A','B','C','D'])
df

      Name  Age  Salary
A    Alice   25   50000
B      Bob   30   60000
C  Charlie   35   70000
D    David   40   80000

a)Select the raw whwere the index is 'B' using .loc[]:

In [4]:
result=df.loc['B']
print(result)

Name        Bob
Age          30
Salary    60000
Name: B, dtype: object

b)Select the salary of 'Charlie'using .loc[]:

In [6]:
result=df.loc['C','Salary']
result

70000

c)selecting columns using .iloc[]:
1)select first tow rows and first two columns using .iloc

In [8]:
result=df.iloc[:2,:2] #OR [0:2]
result

    Name  Age
A  Alice   25
B    Bob   30

2.) Select the last row  and last  column using .iloc[]:

In [10]:
result=df.iloc[-1,-1]
print(result)

80000

1.Select rows where age is greater than 30 using loc[]:
2.Select only name and salary columns for rows where salary is greater than 60,000
3.Change David's salary to 90,000 using .loc[]:
4.Change the age of the second row to 28 using iloc[]:
5.Select rows from B to D using LOC[]:
6.Select columns 'Age' and Salary using iloc[]:
Celeb the first three rows using .iloc[]:

In [18]:
result=(df.loc[(df.Age > 30)])
result

# result = df.loc[df['Age']>30]
# print(result)

      Name  Age  Salary
C  Charlie   35   70000
D    David   40  900000

In [14]:
result=(df[['Name','Salary']][df['Salary']>60000])
result
# result=df.loc[df['Salary']>600000,['Name','Salary']]
# result

      Name  Salary
C  Charlie   70000
D    David   80000

In [16]:
df.loc[(df.Name == "David"), ['Salary']] = 900000
df
# df.loc['D','Salary']=90000
# print(df)

      Name  Age  Salary
A    Alice   25   50000
B      Bob   30   60000
C  Charlie   35   70000
D    David   40  900000

In [20]:
result=df.loc['B':'D']
print(result)

      Name  Age  Salary
B      Bob   30   60000
C  Charlie   35   70000
D    David   40  900000

In [22]:
# 5. Select rows from B to D using loc[]
rows_b_to_d = df.loc['B':'D']

# 6. Select columns 'Age' and 'Salary' using iloc[]
# Assuming 'Age' is at index 1 and 'Salary' is at index 2
columns_age_salary = df.iloc[:, [1, 2]]

# 7. Select the first three rows using iloc[]
first_three_rows = df.iloc[:3]

# Display the results
rows_b_to_d, columns_age_salary, first_three_rows

(      Name  Age  Salary
 B      Bob   30   60000
 C  Charlie   35   70000
 D    David   40  900000,
    Age  Salary
 A   25   50000
 B   30   60000
 C   35   70000
 D   40  900000,
       Name  Age  Salary
 A    Alice   25   50000
 B      Bob   30   60000
 C  Charlie   35   70000)